---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.NeedsRefresh
source: html/b783bf48-150f-57e5-5c51-60b95aa23948.htm
---
# Autodesk.Revit.DB.TableSectionData.NeedsRefresh Property

Indicates if the table data need to refresh.

## Syntax (C#)
```csharp
public bool NeedsRefresh { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: This operation is forbidden for cells in standard schedule body sections.